
## Terraform plan for environment: `dev`

**Commit:** 737b500c5e5b6500fe3e73b20f80c5551820b26b


**API version:** 5839261e45
**CLI version:** 5839261e45
**Selfserve version:** db950373bd
**Internal version:** release-v5.13.1
**search version:** 6dd84e6ac4

### Plan summary

`2 to add, 81 to change, 1 to destroy`

**🆕 Creates**

```tf
module.service.module.ecs_service["api"].aws_ecs_task_definition.this[0]
module.service.module.ecs_service["selfserve"].aws_ecs_task_definition.this[0]
```
**🗑️ Deletes**

```tf
null_resource.deployed_versions
```
**📖 Reads**

```tf
module.service.module.ecs_service["api"].data.aws_ecs_task_definition.this[0]
module.service.module.ecs_service["selfserve"].data.aws_ecs_task_definition.this[0]
module.service.module.eventbridge.data.aws_iam_policy_document.additional_inline[0]
```
**🔄 Updates**

```tf
module.service.module.batch.aws_batch_job_definition.this["cancel-unsubmitted-bilateral"]
module.service.module.batch.aws_batch_job_definition.this["ch-vs-olcs-diffs"]
module.service.module.batch.aws_batch_job_definition.this["clean-up-variations"]
module.service.module.batch.aws_batch_job_definition.this["close-expired-windows"]
module.service.module.batch.aws_batch_job_definition.this["cns"]
module.service.module.batch.aws_batch_job_definition.this["company-profile-dlq"]
module.service.module.batch.aws_batch_job_definition.this["create-psv-licence-surrender-task"]
module.service.module.batch.aws_batch_job_definition.this["data-retention-delete"]
module.service.module.batch.aws_batch_job_definition.this["data-retention-populate"]
module.service.module.batch.aws_batch_job_definition.this["data-retention-postcheck"]
module.service.module.batch.aws_batch_job_definition.this["data-retention-precheck"]
module.service.module.batch.aws_batch_job_definition.this["database-maintenance"]
module.service.module.batch.aws_batch_job_definition.this["digital-continuation-reminders"]
module.service.module.batch.aws_batch_job_definition.this["duplicate-vehicle-warning"]
module.service.module.batch.aws_batch_job_definition.this["enqueue-ch-compare"]
module.service.module.batch.aws_batch_job_definition.this["expire-bus-registration"]
module.service.module.batch.aws_batch_job_definition.this["flag-urgent-tasks"]
module.service.module.batch.aws_batch_job_definition.this["import-users-from-csv"]
module.service.module.batch.aws_batch_job_definition.this["inspection-request-email"]
module.service.module.batch.aws_batch_job_definition.this["interim-end-date-enforcement"]
module.service.module.batch.aws_batch_job_definition.this["international-goods-export"]
module.service.module.batch.aws_batch_job_definition.this["last-tm-letter"]
module.service.module.batch.aws_batch_job_definition.this["licence-status-rules"]
module.service.module.batch.aws_batch_job_definition.this["mark-expired-permits"]
module.service.module.batch.aws_batch_job_definition.this["process-cl"]
module.service.module.batch.aws_batch_job_definition.this["process-company-profile"]
module.service.module.batch.aws_batch_job_definition.this["process-inbox"]
module.service.module.batch.aws_batch_job_definition.this["process-insolvency"]
module.service.module.batch.aws_batch_job_definition.this["process-insolvency-dlq"]
module.service.module.batch.aws_batch_job_definition.this["process-ntu"]
module.service.module.batch.aws_batch_job_definition.this["process-queue-community-licences"]
module.service.module.batch.aws_batch_job_definition.this["process-queue-disc-generation"]
module.service.module.batch.aws_batch_job_definition.this["process-queue-disc-print"]
module.service.module.batch.aws_batch_job_definition.this["process-queue-ecmt-accept"]
module.service.module.batch.aws_batch_job_definition.this["process-queue-general"]
module.service.module.batch.aws_batch_job_definition.this["process-queue-irhp-allocate"]
module.service.module.batch.aws_batch_job_definition.this["process-queue-permit-generation"]
module.service.module.batch.aws_batch_job_definition.this["process-queue-permit-print"]
module.service.module.batch.aws_batch_job_definition.this["process-queue-print"]
module.service.module.batch.aws_batch_job_definition.this["psv-operator-list-export"]
module.service.module.batch.aws_batch_job_definition.this["remove-read-audit"]
module.service.module.batch.aws_batch_job_definition.this["resolve-payments"]
module.service.module.batch.aws_batch_job_definition.this["system-parameter"]
module.service.module.batch.aws_batch_job_definition.this["transxchange-consumer"]
module.service.module.ecs_service["api"].aws_ecs_service.this[0]
module.service.module.ecs_service["selfserve"].aws_ecs_service.this[0]
module.service.module.eventbridge.aws_iam_policy.additional_inline[0]
module.service.module.eventbridge.aws_scheduler_schedule.this["clean-up-variations"]
module.service.module.eventbridge.aws_scheduler_schedule.this["close-expired-windows"]
module.service.module.eventbridge.aws_scheduler_schedule.this["cns"]
module.service.module.eventbridge.aws_scheduler_schedule.this["company-profile-dlq"]
module.service.module.eventbridge.aws_scheduler_schedule.this["create-psv-licence-surrender-task"]
module.service.module.eventbridge.aws_scheduler_schedule.this["digital-continuation-reminders"]
module.service.module.eventbridge.aws_scheduler_schedule.this["duplicate-vehicle-warning"]
module.service.module.eventbridge.aws_scheduler_schedule.this["enqueue-ch-compare"]
module.service.module.eventbridge.aws_scheduler_schedule.this["expire-bus-registration"]
module.service.module.eventbridge.aws_scheduler_schedule.this["flag-urgent-tasks"]
module.service.module.eventbridge.aws_scheduler_schedule.this["inspection-request-email"]
module.service.module.eventbridge.aws_scheduler_schedule.this["interim-end-date-enforcement"]
module.service.module.eventbridge.aws_scheduler_schedule.this["international-goods-export"]
module.service.module.eventbridge.aws_scheduler_schedule.this["last-tm-letter"]
module.service.module.eventbridge.aws_scheduler_schedule.this["licence-status-rules"]
module.service.module.eventbridge.aws_scheduler_schedule.this["mark-expired-permits"]
module.service.module.eventbridge.aws_scheduler_schedule.this["process-company-profile"]
module.service.module.eventbridge.aws_scheduler_schedule.this["process-inbox"]
module.service.module.eventbridge.aws_scheduler_schedule.this["process-insolvency"]
module.service.module.eventbridge.aws_scheduler_schedule.this["process-insolvency-dlq"]
module.service.module.eventbridge.aws_scheduler_schedule.this["process-ntu"]
module.service.module.eventbridge.aws_scheduler_schedule.this["process-queue-community-licences"]
module.service.module.eventbridge.aws_scheduler_schedule.this["process-queue-disc-generation"]
module.service.module.eventbridge.aws_scheduler_schedule.this["process-queue-disc-print"]
module.service.module.eventbridge.aws_scheduler_schedule.this["process-queue-ecmt-accept"]
module.service.module.eventbridge.aws_scheduler_schedule.this["process-queue-general"]
module.service.module.eventbridge.aws_scheduler_schedule.this["process-queue-irhp-allocate"]
module.service.module.eventbridge.aws_scheduler_schedule.this["process-queue-permit-generation"]
module.service.module.eventbridge.aws_scheduler_schedule.this["process-queue-permit-print"]
module.service.module.eventbridge.aws_scheduler_schedule.this["process-queue-print"]
module.service.module.eventbridge.aws_scheduler_schedule.this["psv-operator-list-export"]
module.service.module.eventbridge.aws_scheduler_schedule.this["remove-read-audit"]
module.service.module.eventbridge.aws_scheduler_schedule.this["resolve-payments"]
module.service.module.eventbridge.aws_scheduler_schedule.this["transxchange-consumer"]
```


----

<details data-gh-workflow="dev-environment-plan"><summary>Show full plan</summary>

```tf


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement
+/- create replacement and then destroy
 <= read (data resources)

Terraform will perform the following actions:

  # null_resource.deployed_versions must be replaced
-/+ resource "null_resource" "deployed_versions" {
      ~ id       = "3421014439845340172" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "deployed_api_image_tag"       = "release-v5.13.1" -> "5839261e45"
          ~ "deployed_cli_image_tag"       = "release-v5.13.1" -> "5839261e45"
          ~ "deployed_selfserve_image_tag" = "release-v5.13.1" -> "db950373bd"
            # (2 unchanged elements hidden)
        }
    }

  # module.service.module.batch.aws_batch_job_definition.this["cancel-unsubmitted-bilateral"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-cancel-unsubmitted-bilateral:87" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ command                      = [
                  + "/var/www/html/vendor/bin/laminas",
                  + "--container=/var/www/html/config/container-cli.php",
                    "permits:cancel-unsubmitted-bilateral",
                ]
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "release-v5.13.1" -> "DEV"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "DEV" -> "5839261e45"
                    },
                ]
              ~ image                        = "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:release-v5.13.1" -> "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:5839261e45"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (6 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-cancel-unsubmitted-bilateral:87"
        name                       = "vol-app-dev-cancel-unsubmitted-bilateral"
      ~ revision                   = 87 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["ch-vs-olcs-diffs"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-ch-vs-olcs-diffs:87" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ command                      = [
                  + "/var/www/html/vendor/bin/laminas",
                  + "--container=/var/www/html/config/container-cli.php",
                    "batch:ch-vs-olcs-diffs",
                ]
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "release-v5.13.1" -> "DEV"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "DEV" -> "5839261e45"
                    },
                ]
              ~ image                        = "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:release-v5.13.1" -> "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:5839261e45"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (6 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-ch-vs-olcs-diffs:87"
        name                       = "vol-app-dev-ch-vs-olcs-diffs"
      ~ revision                   = 87 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["clean-up-variations"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-clean-up-variations:87" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ command                      = [
                  + "/var/www/html/vendor/bin/laminas",
                  + "--container=/var/www/html/config/container-cli.php",
                    "batch:clean-up-variations",
                ]
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "release-v5.13.1" -> "DEV"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "DEV" -> "5839261e45"
                    },
                ]
              ~ image                        = "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:release-v5.13.1" -> "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:5839261e45"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (6 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-clean-up-variations:87"
        name                       = "vol-app-dev-clean-up-variations"
      ~ revision                   = 87 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["close-expired-windows"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-close-expired-windows:87" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ command                      = [
                  + "/var/www/html/vendor/bin/laminas",
                  + "--container=/var/www/html/config/container-cli.php",
                    "permits:close-expired-windows",
                ]
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "release-v5.13.1" -> "DEV"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "DEV" -> "5839261e45"
                    },
                ]
              ~ image                        = "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:release-v5.13.1" -> "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:5839261e45"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (6 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-close-expired-windows:87"
        name                       = "vol-app-dev-close-expired-windows"
      ~ revision                   = 87 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["cns"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-cns:87" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ command                      = [
                  + "/var/www/html/vendor/bin/laminas",
                  + "--container=/var/www/html/config/container-cli.php",
                    "batch:cns",
                ]
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "release-v5.13.1" -> "DEV"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "DEV" -> "5839261e45"
                    },
                ]
              ~ image                        = "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:release-v5.13.1" -> "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:5839261e45"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (6 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-cns:87"
        name                       = "vol-app-dev-cns"
      ~ revision                   = 87 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["company-profile-dlq"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-company-profile-dlq:87" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ command                      = [
                  + "/var/www/html/vendor/bin/laminas",
                  + "--container=/var/www/html/config/container-cli.php",
                    "queue:company-profile-dlq",
                ]
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "release-v5.13.1" -> "DEV"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "DEV" -> "5839261e45"
                    },
                ]
              ~ image                        = "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:release-v5.13.1" -> "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:5839261e45"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (6 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-company-profile-dlq:87"
        name                       = "vol-app-dev-company-profile-dlq"
      ~ revision                   = 87 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["create-psv-licence-surrender-task"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-create-psv-licence-surrender-task:87" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ command                      = [
                  + "/var/www/html/vendor/bin/laminas",
                  + "--container=/var/www/html/config/container-cli.php",
                    "batch:create-psv-licence-surrender-task",
                ]
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "release-v5.13.1" -> "DEV"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "DEV" -> "5839261e45"
                    },
                ]
              ~ image                        = "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:release-v5.13.1" -> "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:5839261e45"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (6 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-create-psv-licence-surrender-task:87"
        name                       = "vol-app-dev-create-psv-licence-surrender-task"
      ~ revision                   = 87 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["data-retention-delete"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-data-retention-delete:87" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ command                      = [
                  + "/var/www/html/vendor/bin/laminas",
                  + "--container=/var/www/html/config/container-cli.php",
                    "batch:data-retention",
                    # (1 unchanged element hidden)
                ]
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "release-v5.13.1" -> "DEV"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "DEV" -> "5839261e45"
                    },
                ]
              ~ image                        = "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:release-v5.13.1" -> "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:5839261e45"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (6 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-data-retention-delete:87"
        name                       = "vol-app-dev-data-retention-delete"
      ~ revision                   = 87 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["data-retention-populate"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-data-retention-populate:87" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ command                      = [
                  + "/var/www/html/vendor/bin/laminas",
                  + "--container=/var/www/html/config/container-cli.php",
                    "batch:data-retention",
                    # (1 unchanged element hidden)
                ]
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "release-v5.13.1" -> "DEV"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "DEV" -> "5839261e45"
                    },
                ]
              ~ image                        = "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:release-v5.13.1" -> "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:5839261e45"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (6 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-data-retention-populate:87"
        name                       = "vol-app-dev-data-retention-populate"
      ~ revision                   = 87 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["data-retention-postcheck"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-data-retention-postcheck:87" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ command                      = [
                  + "/var/www/html/vendor/bin/laminas",
                  + "--container=/var/www/html/config/container-cli.php",
                    "batch:data-retention",
                    # (1 unchanged element hidden)
                ]
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "release-v5.13.1" -> "DEV"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "DEV" -> "5839261e45"
                    },
                ]
              ~ image                        = "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:release-v5.13.1" -> "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:5839261e45"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (6 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-data-retention-postcheck:87"
        name                       = "vol-app-dev-data-retention-postcheck"
      ~ revision                   = 87 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["data-retention-precheck"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-data-retention-precheck:87" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ command                      = [
                  + "/var/www/html/vendor/bin/laminas",
                  + "--container=/var/www/html/config/container-cli.php",
                    "batch:data-retention",
                    # (1 unchanged element hidden)
                ]
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "release-v5.13.1" -> "DEV"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "DEV" -> "5839261e45"
                    },
                ]
              ~ image                        = "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:release-v5.13.1" -> "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:5839261e45"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (6 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-data-retention-precheck:87"
        name                       = "vol-app-dev-data-retention-precheck"
      ~ revision                   = 87 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["database-maintenance"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-database-maintenance:87" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ command                      = [
                  + "/var/www/html/vendor/bin/laminas",
                  + "--container=/var/www/html/config/container-cli.php",
                    "batch:database-maintenance",
                ]
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "release-v5.13.1" -> "DEV"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "DEV" -> "5839261e45"
                    },
                ]
              ~ image                        = "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:release-v5.13.1" -> "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:5839261e45"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (6 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-database-maintenance:87"
        name                       = "vol-app-dev-database-maintenance"
      ~ revision                   = 87 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["digital-continuation-reminders"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-digital-continuation-reminders:87" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ command                      = [
                  + "/var/www/html/vendor/bin/laminas",
                  + "--container=/var/www/html/config/container-cli.php",
                    "batch:digital-continuation-reminders",
                ]
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "release-v5.13.1" -> "DEV"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "DEV" -> "5839261e45"
                    },
                ]
              ~ image                        = "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:release-v5.13.1" -> "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:5839261e45"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (6 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-digital-continuation-reminders:87"
        name                       = "vol-app-dev-digital-continuation-reminders"
      ~ revision                   = 87 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["duplicate-vehicle-warning"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-duplicate-vehicle-warning:87" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ command                      = [
                  + "/var/www/html/vendor/bin/laminas",
                  + "--container=/var/www/html/config/container-cli.php",
                    "batch:duplicate-vehicle-warning",
                ]
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "release-v5.13.1" -> "DEV"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "DEV" -> "5839261e45"
                    },
                ]
              ~ image                        = "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:release-v5.13.1" -> "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:5839261e45"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (6 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-duplicate-vehicle-warning:87"
        name                       = "vol-app-dev-duplicate-vehicle-warning"
      ~ revision                   = 87 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["enqueue-ch-compare"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-enqueue-ch-compare:87" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ command                      = [
                  + "/var/www/html/vendor/bin/laminas",
                  + "--container=/var/www/html/config/container-cli.php",
                    "batch:enqueue-ch-compare",
                ]
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "release-v5.13.1" -> "DEV"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "DEV" -> "5839261e45"
                    },
                ]
              ~ image                        = "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:release-v5.13.1" -> "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:5839261e45"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (6 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-enqueue-ch-compare:87"
        name                       = "vol-app-dev-enqueue-ch-compare"
      ~ revision                   = 87 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["expire-bus-registration"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-expire-bus-registration:87" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ command                      = [
                  + "/var/www/html/vendor/bin/laminas",
                  + "--container=/var/www/html/config/container-cli.php",
                    "batch:expire-bus-registration",
                ]
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "release-v5.13.1" -> "DEV"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "DEV" -> "5839261e45"
                    },
                ]
              ~ image                        = "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:release-v5.13.1" -> "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:5839261e45"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (6 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-expire-bus-registration:87"
        name                       = "vol-app-dev-expire-bus-registration"
      ~ revision                   = 87 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["flag-urgent-tasks"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-flag-urgent-tasks:87" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ command                      = [
                  + "/var/www/html/vendor/bin/laminas",
                  + "--container=/var/www/html/config/container-cli.php",
                    "batch:flag-urgent-tasks",
                ]
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "release-v5.13.1" -> "DEV"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "DEV" -> "5839261e45"
                    },
                ]
              ~ image                        = "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:release-v5.13.1" -> "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:5839261e45"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (6 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-flag-urgent-tasks:87"
        name                       = "vol-app-dev-flag-urgent-tasks"
      ~ revision                   = 87 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["import-users-from-csv"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-import-users-from-csv:87" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ command                      = [
                  + "/var/www/html/vendor/bin/laminas",
                  + "--container=/var/www/html/config/container-cli.php",
                    "batch:import-users-from-csv",
                ]
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "release-v5.13.1" -> "DEV"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "DEV" -> "5839261e45"
                    },
                ]
              ~ image                        = "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:release-v5.13.1" -> "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:5839261e45"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (6 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-import-users-from-csv:87"
        name                       = "vol-app-dev-import-users-from-csv"
      ~ revision                   = 87 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["inspection-request-email"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-inspection-request-email:87" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ command                      = [
                  + "/var/www/html/vendor/bin/laminas",
                  + "--container=/var/www/html/config/container-cli.php",
                    "batch:inspection-request-email",
                ]
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "release-v5.13.1" -> "DEV"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "DEV" -> "5839261e45"
                    },
                ]
              ~ image                        = "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:release-v5.13.1" -> "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:5839261e45"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (6 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-inspection-request-email:87"
        name                       = "vol-app-dev-inspection-request-email"
      ~ revision                   = 87 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["interim-end-date-enforcement"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-interim-end-date-enforcement:87" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ command                      = [
                  + "/var/www/html/vendor/bin/laminas",
                  + "--container=/var/www/html/config/container-cli.php",
                    "batch:interim-end-date-enforcement",
                ]
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "release-v5.13.1" -> "DEV"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "DEV" -> "5839261e45"
                    },
                ]
              ~ image                        = "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:release-v5.13.1" -> "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:5839261e45"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (6 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-interim-end-date-enforcement:87"
        name                       = "vol-app-dev-interim-end-date-enforcement"
      ~ revision                   = 87 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["international-goods-export"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-international-goods-export:87" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ command                      = [
                  + "/var/www/html/vendor/bin/laminas",
                  + "--container=/var/www/html/config/container-cli.php",
                    "batch:data-gov-uk-export",
                    # (3 unchanged elements hidden)
                ]
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "release-v5.13.1" -> "DEV"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "DEV" -> "5839261e45"
                    },
                ]
              ~ image                        = "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:release-v5.13.1" -> "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:5839261e45"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (6 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-international-goods-export:87"
        name                       = "vol-app-dev-international-goods-export"
      ~ revision                   = 87 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["last-tm-letter"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-last-tm-letter:87" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ command                      = [
                  + "/var/www/html/vendor/bin/laminas",
                  + "--container=/var/www/html/config/container-cli.php",
                    "batch:last-tm-letter",
                ]
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "release-v5.13.1" -> "DEV"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "DEV" -> "5839261e45"
                    },
                ]
              ~ image                        = "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:release-v5.13.1" -> "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:5839261e45"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (6 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-last-tm-letter:87"
        name                       = "vol-app-dev-last-tm-letter"
      ~ revision                   = 87 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["licence-status-rules"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-licence-status-rules:87" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ command                      = [
                  + "/var/www/html/vendor/bin/laminas",
                  + "--container=/var/www/html/config/container-cli.php",
                    "batch:licence-status-rules",
                ]
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "release-v5.13.1" -> "DEV"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "DEV" -> "5839261e45"
                    },
                ]
              ~ image                        = "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:release-v5.13.1" -> "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:5839261e45"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (6 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-licence-status-rules:87"
        name                       = "vol-app-dev-licence-status-rules"
      ~ revision                   = 87 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["mark-expired-permits"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-mark-expired-permits:87" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ command                      = [
                  + "/var/www/html/vendor/bin/laminas",
                  + "--container=/var/www/html/config/container-cli.php",
                    "permits:mark-expired-permits",
                ]
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "release-v5.13.1" -> "DEV"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "DEV" -> "5839261e45"
                    },
                ]
              ~ image                        = "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:release-v5.13.1" -> "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:5839261e45"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (6 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-mark-expired-permits:87"
        name                       = "vol-app-dev-mark-expired-permits"
      ~ revision                   = 87 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["process-cl"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-process-cl:87" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ command                      = [
                  + "/var/www/html/vendor/bin/laminas",
                  + "--container=/var/www/html/config/container-cli.php",
                    "batch:process-cl",
                ]
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "release-v5.13.1" -> "DEV"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "DEV" -> "5839261e45"
                    },
                ]
              ~ image                        = "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:release-v5.13.1" -> "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:5839261e45"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (6 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-process-cl:87"
        name                       = "vol-app-dev-process-cl"
      ~ revision                   = 87 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["process-company-profile"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-process-company-profile:87" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ command                      = [
                  + "/var/www/html/vendor/bin/laminas",
                  + "--container=/var/www/html/config/container-cli.php",
                    "queue:process-company-profile",
                ]
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "release-v5.13.1" -> "DEV"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "DEV" -> "5839261e45"
                    },
                ]
              ~ image                        = "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:release-v5.13.1" -> "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:5839261e45"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (6 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-process-company-profile:87"
        name                       = "vol-app-dev-process-company-profile"
      ~ revision                   = 87 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["process-inbox"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-process-inbox:87" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ command                      = [
                  + "/var/www/html/vendor/bin/laminas",
                  + "--container=/var/www/html/config/container-cli.php",
                    "batch:process-inbox",
                ]
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "release-v5.13.1" -> "DEV"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "DEV" -> "5839261e45"
                    },
                ]
              ~ image                        = "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:release-v5.13.1" -> "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:5839261e45"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (6 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-process-inbox:87"
        name                       = "vol-app-dev-process-inbox"
      ~ revision                   = 87 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["process-insolvency"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-process-insolvency:87" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ command                      = [
                  + "/var/www/html/vendor/bin/laminas",
                  + "--container=/var/www/html/config/container-cli.php",
                    "queue:process-insolvency",
                ]
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "release-v5.13.1" -> "DEV"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "DEV" -> "5839261e45"
                    },
                ]
              ~ image                        = "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:release-v5.13.1" -> "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:5839261e45"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (6 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-process-insolvency:87"
        name                       = "vol-app-dev-process-insolvency"
      ~ revision                   = 87 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["process-insolvency-dlq"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-process-insolvency-dlq:87" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ command                      = [
                  + "/var/www/html/vendor/bin/laminas",
                  + "--container=/var/www/html/config/container-cli.php",
                    "queue:process-insolvency-dlq",
                ]
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "release-v5.13.1" -> "DEV"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "DEV" -> "5839261e45"
                    },
                ]
              ~ image                        = "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:release-v5.13.1" -> "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:5839261e45"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (6 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-process-insolvency-dlq:87"
        name                       = "vol-app-dev-process-insolvency-dlq"
      ~ revision                   = 87 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["process-ntu"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-process-ntu:87" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ command                      = [
                  + "/var/www/html/vendor/bin/laminas",
                  + "--container=/var/www/html/config/container-cli.php",
                    "batch:process-ntu",
                ]
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "release-v5.13.1" -> "DEV"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "DEV" -> "5839261e45"
                    },
                ]
              ~ image                        = "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:release-v5.13.1" -> "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:5839261e45"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (6 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-process-ntu:87"
        name                       = "vol-app-dev-process-ntu"
      ~ revision                   = 87 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["process-queue-community-licences"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-process-queue-community-licences:87" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ command                      = [
                  + "/var/www/html/vendor/bin/laminas",
                  + "--container=/var/www/html/config/container-cli.php",
                    "queue:process-queue",
                    # (2 unchanged elements hidden)
                ]
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "release-v5.13.1" -> "DEV"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "DEV" -> "5839261e45"
                    },
                ]
              ~ image                        = "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:release-v5.13.1" -> "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:5839261e45"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (6 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-process-queue-community-licences:87"
        name                       = "vol-app-dev-process-queue-community-licences"
      ~ revision                   = 87 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["process-queue-disc-generation"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-process-queue-disc-generation:87" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ command                      = [
                  + "/var/www/html/vendor/bin/laminas",
                  + "--container=/var/www/html/config/container-cli.php",
                    "queue:process-queue",
                    # (2 unchanged elements hidden)
                ]
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "release-v5.13.1" -> "DEV"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "DEV" -> "5839261e45"
                    },
                ]
              ~ image                        = "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:release-v5.13.1" -> "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:5839261e45"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (6 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-process-queue-disc-generation:87"
        name                       = "vol-app-dev-process-queue-disc-generation"
      ~ revision                   = 87 ... (truncated, see full plan in the workflow run logs)
```

</details>